# 合計，平均，最大，最小を求めるプログラ ムを作成せよ
data = [369, 258, 134, 855, 397, 317, 472, 433, 127, 540,
        429, 886, 771,  79, 539, 383, 911, 482, 231, 827,
        920, 473, 520,  37,  56, 649, 520, 676, 927, 515,
        552, 458, 881, 810, 739,  43, 284,  12, 739, 429,
        137, 259, 500, 737, 291, 221, 571,  34, 360,  84,
        341, 898, 238, 586,  37, 462,  99, 820,  15, 180,
        128,  27, 201, 756, 879, 433, 786, 722, 439, 448,
        336, 993, 441, 418,   9, 789, 783, 586, 447, 616,
        525,  57, 200, 775, 513,  11,   7, 204, 245, 792,
        865, 922, 128, 688, 960, 468, 680, 445,  73,  80,]

sum, avg = 0, 0


for i in range(len(data)) :
   sum += data[i] 
avg = sum/len(data)
print(sum, avg, max(data), min(data))

#max 랑 min 변수명 쓰면 안됨 
#TypeError: 'int' object is not callable 이 오류 뿜어서 찾아보니까 이미 설정 되어 있는 변수를 쓰면 사용할 수 없게 막아둠
#쓸려면 del 함수로 지워줘야 되는데 굳이..? 이름을 바꿔서 func 구현을 하던가